# MENATA ULANG DATA FRAME DENGAN MULTIPLE INDEXES MENGGUNAKAN UNSTRACT() ###

## Import Modules ###

In [1]:
import pandas as pd

print(pd.__version__)

1.3.4

## Persiapan Data Frame ##

In [7]:
df = pd.read_csv('./Kaggle_DataSet/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### Data Frame Dengan Multiple Indexes Dari Hasil Groupping ##

In [8]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

In [9]:
df.groupby(['sex', 'pclass'])['survived'].mean()

sex     pclass
female  1         0.965278
        2         0.886792
        3         0.490741
male    1         0.340782
        2         0.146199
        3         0.152130
Name: survived, dtype: float64

Bila tidak ada to_frame() hasilnya kurang cantik atau manis atau rapih

### Menata Ulang Data Frame Dengan Multiple Indexes ###

In [10]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

Perbedaan dengan to_frame, tampilan table unstack() lebih mudah di baca dan lebih nyaman untuk di lihat